![](pic/mysql2.jpg)

## 복습: SELECT 문

<span style="color:blue; font-size: 1.2em;" >
SELECT&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;expr   
FROM&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;table  
[WHERE &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;condition(s)]  
[ORDER BY&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;{column, expr, numeric_position} [ASC|DESC]]; </span>

* WHERE 절은 조건을 나타낸다.
* ORDER BY 절은 정렬기준을 나타낸다.

<br><br><br><br><br><br>
**<span style="color:red">
다음 셀은 mysql DB와 편집기를 연결하는 명령입니다.  
수업을 시작할 때 마다 가장 먼저 실행하여야 합니다.**

In [1]:
import pymysql
pymysql.install_as_MySQLdb()
%load_ext sql
%sql mysql://root:hannam@localhost/galaxy

C:\Users\PC-14\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xB4\\xEB\\xC7\\xD1\\xB9\\xCE...' for column 'VARIABLE_VALUE' at row 518")
  result = self._query(query)
C:\Users\PC-14\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (3719, "'utf8' is currently an alias for the character set UTF8MB3, but will be an alias for UTF8MB4 in a future release. Please consider using UTF8MB4 in order to be unambiguous.")
  result = self._query(query)

'Connected: root@galaxy'

# 3장      함수
<br><br><br><br>


![](pic/pic3_1.jpg)

## 두 종류의 함수


![](pic/pic3_2.jpg)

## 단일 행 함수


* 인수를 사용하고 값을 하나 반환한다.
* 각 행 마다 값을 하나 반환한다.
* 중첩될 수 있다.
* 열 또는 표현식을 인수로 사용한다.

<span style="color:blue; font-size: 1.2em;" >
함수이름 [ (인수1, 인수2, ...) ] 



![](pic/pic3_3.jpg) 
<br><br><br><br>

### 문자 함수


![](pic/pic3_4.jpg)

<br><br><br><br>
![](pic/pic3_5.jpg)
![](pic/pic3_6.jpg)

### 대문자 소문자 변환 함수


![](pic/pic3_7.jpg)
<br><br><br><br>

In [2]:
%%sql 
SELECT last_name
FROM   employees;

 * mysql://root:***@localhost/galaxy
19 rows affected.

[('Davies',),
 ('De Haan',),
 ('Ernst',),
 ('Fay',),
 ('Gietz',),
 ('Grant',),
 ('Hartstein',),
 ('Higgins',),
 ('Hunold',),
 ('King',),
 ('Kochhar',),
 ('Lorentz',),
 ('Matos',),
 ('Mourgos',),
 ('Rajs',),
 ('Taylor',),
 ('Vargas',),
 ('Whalen',),
 ('Zlotkey',)]

In [3]:
%%sql 
SELECT LOWER(last_name)
FROM   employees;

 * mysql://root:***@localhost/galaxy
19 rows affected.

[('davies',),
 ('de haan',),
 ('ernst',),
 ('fay',),
 ('gietz',),
 ('grant',),
 ('hartstein',),
 ('higgins',),
 ('hunold',),
 ('king',),
 ('kochhar',),
 ('lorentz',),
 ('matos',),
 ('mourgos',),
 ('rajs',),
 ('taylor',),
 ('vargas',),
 ('whalen',),
 ('zlotkey',)]

<br><br>
<span style="color:red">[연습 1]</span>   
last name을 모두 대문자로 나타내면?

In [4]:
%%sql 
SELECT upper(last_name)
FROM   employees;

 * mysql://root:***@localhost/galaxy
19 rows affected.

[('DAVIES',),
 ('DE HAAN',),
 ('ERNST',),
 ('FAY',),
 ('GIETZ',),
 ('GRANT',),
 ('HARTSTEIN',),
 ('HIGGINS',),
 ('HUNOLD',),
 ('KING',),
 ('KOCHHAR',),
 ('LORENTZ',),
 ('MATOS',),
 ('MOURGOS',),
 ('RAJS',),
 ('TAYLOR',),
 ('VARGAS',),
 ('WHALEN',),
 ('ZLOTKEY',)]

<br><br>
<span style="color:red">[연습 2]</span>   
last name 이 higgins 인 직원의 이름과 성은? ?

In [9]:
%sql SELECT * from employees;

 * mysql://root:***@localhost/galaxy
19 rows affected.

[(100, 'Steven', 'King', 'SKING', '515.123.4567', datetime.date(1987, 6, 17), 'AD_PRES', Decimal('100000.00'), None, None, 90),
 (101, 'Neena', 'Kochhar', 'NKOCHHAR', '515.123.4568', datetime.date(1989, 9, 21), 'AD_VP', Decimal('100000.00'), None, 100, 90),
 (102, 'Lex', 'De Haan', 'LDEHAAN', '515.123.4569', datetime.date(1993, 1, 13), 'AD_VP', Decimal('100000.00'), None, 100, 90),
 (103, 'Alexander', 'Hunold', 'AHUNOLD', '590.423.4567', datetime.date(1990, 1, 3), 'IT_PROG', Decimal('100000.00'), None, 102, 90),
 (104, 'Bruce', 'Ernst', 'BERNST', '590.423.4568', datetime.date(1991, 5, 21), 'IT_PROG', Decimal('100000.00'), None, 103, 90),
 (107, 'Diana', 'Lorentz', 'DLORENTZ', '590.423.5567', datetime.date(1999, 2, 7), 'IT_PROG', Decimal('100000.00'), None, 103, 90),
 (124, 'Kevin', 'Mourgos', 'KMOURGOS', '650.123.5234', datetime.date(1999, 11, 16), 'ST_MAN', Decimal('100000.00'), None, 100, 50),
 (141, 'Trenna', 'Rajs', 'TRAJS', '650.121.8009', datetime.date(1995, 10, 17), 'ST_CLERK', Decimal('100000.00'), None, 124, 50),
 (142, 'Curtis', 'Davies', 'CDAVIES', '650.121.2994', datetime.date(1997, 1, 29), 'ST_CLERK', Decimal('100000.00'), None, 124, 50),
 (143, 'Randall', 'Matos', 'RMATOS', '650.121.2874', datetime.date(1998, 3, 15), 'ST_CLERK', Decimal('100000.00'), None, 124, 50),
 (144, 'Peter', 'Vargas', 'PVARGAS', '650.121.2004', datetime.date(1998, 7, 9), 'ST_CLERK', Decimal('100000.00'), None, 124, 50),
 (149, 'Eleni', 'Zlotkey', 'EZLOTKEY', '011.44.1344.429018', datetime.date(2000, 1, 29), 'SA_MAN', Decimal('100000.00'), Decimal('0.20'), 100, 80),
 (176, 'Jonathon', 'Taylor', 'JTAYLOR', '011.44.1644.429265', datetime.date(1998, 3, 24), 'SA_REP', Decimal('100000.00'), Decimal('0.20'), 149, 80),
 (178, 'Kimberely', 'Grant', 'KGRANT', '011.44.1644.429263', datetime.date(1999, 5, 24), 'SA_REP', Decimal('100000.00'), Decimal('0.15'), 149, None),
 (200, 'Jennifer', 'Whalen', 'JWHALEN', '515.123.4444', datetime.date(1987, 9, 17), 'AD_ASST', Decimal('100000.00'), None, 101, 10),
 (201, 'Michael', 'Hartstein', 'MHARTSTE', '515.123.5555', datetime.date(1996, 2, 17), 'MK_MAN', Decimal('100000.00'), None, 100, 20),
 (202, 'Pat', 'Fay', 'PFAY', '603.123.6666', datetime.date(1997, 8, 17), 'MK_REP', Decimal('100000.00'), None, 201, 20),
 (205, 'Shelley', 'Higgins', 'SHIGGINS', '515.123.8080', datetime.date(1994, 6, 7), 'AC_MGR', Decimal('100000.00'), None, 101, 50),
 (206, 'William', 'Gietz', 'WGIETZ', '515.123.8181', datetime.date(1994, 6, 7), 'AC_ACCOUNT', Decimal('100000.00'), None, 205, 50)]

In [10]:
%%sql 
SELECT last_name, first_name
FROM   employees
where last_name = 'higgins';

 * mysql://root:***@localhost/galaxy
1 rows affected.

[('Higgins', 'Shelley')]

### 문자 제어 함수


<br><br>
![](pic/pic3_8.jpg)
<br><br><br><br>

In [12]:
%%sql 
SELECT employee_id, CONCAT(first_name, last_name) NAME, job_id, 
       LENGTH (last_name), INSTR(last_name, 'a') "Contains 'a'?"
FROM   employees
WHERE  SUBSTR(job_id, 4) = 'REP';

 * mysql://root:***@localhost/galaxy
3 rows affected.

[(176, 'JonathonTaylor', 'SA_REP', 6, 2),
 (178, 'KimberelyGrant', 'SA_REP', 5, 3),
 (202, 'PatFay', 'MK_REP', 3, 2)]

<br><br><br>
substr( ) 함수에 대한 도움말

In [13]:
%sql help substr

 * mysql://root:***@localhost/galaxy
1 rows affected.

[('SUBSTR', 'Syntax:\nSUBSTR(str,pos), SUBSTR(str FROM pos), SUBSTR(str,pos,len), SUBSTR(str\nFROM pos FOR len)\n\nSUBSTR() is a synonym for SUBSTRING().\n\nURL: http://dev.mysql.com/doc/refman/8.0/en/string-functions.html\n\n', '')]

### 숫자 함수


* ROUND: 반올림하여 소수점 몇째 자리까지 나타낸다.
* TRUNCATE: 버림
* MOD: 나머지 연산 기호

![](pic/pic3_9.jpg)
<br><br><br><br>

In [17]:
%%sql  
SELECT ROUND(45.923,2), ROUND(45.923,0), ROUND(45.923,-1)
FROM   DUAL;

 * mysql://root:***@localhost/galaxy
1 rows affected.

[(Decimal('45.92'), Decimal('46'), Decimal('50'))]

<br>
DUAL 은 dummy 테이블이다.
<br><br>

In [18]:
%sql  SELECT ROUND(45.923,2), ROUND(45.923,0), ROUND(45.923,-1);

 * mysql://root:***@localhost/galaxy
1 rows affected.

[(Decimal('45.92'), Decimal('46'), Decimal('50'))]

In [22]:
%%sql  
SELECT TRUNCATE(45.923,2), TRUNCATE(45.923), TRUNCATE(45.923,-1)
FROM   DUAL;

 * mysql://root:***@localhost/galaxy
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '), TRUNCATE(45.923,-1)\nFROM   DUAL' at line 1") [SQL: 'SELECT TRUNCATE(45.923,2), TRUNCATE(45.923), TRUNCATE(45.923,-1)\nFROM   DUAL;'] (Background on this error at: http://sqlalche.me/e/f405)

In [20]:
%%sql  
SELECT last_name, salary, MOD(salary, 5000)
FROM   employees
WHERE  job_id = 'SA_REP';

 * mysql://root:***@localhost/galaxy
2 rows affected.

[('Taylor', Decimal('100000.00'), Decimal('0.00')),
 ('Grant', Decimal('100000.00'), Decimal('0.00'))]

### 날짜 함수


* 기본 형태는 YYYY_MM_DD 다

In [ ]:
%%sql  
SELECT last_name, hire_date
FROM   employees
WHERE  hire_date < '1988-12-25';

In [73]:
%%sql  
SELECT SYSDATE()
FROM   DUAL;

 * mysql://root:***@localhost/galaxy
1 rows affected.

[(datetime.datetime(2019, 9, 25, 16, 35, 4),)]

In [ ]:
%sql  SELECT SYSDATE();

### 중첩 함수


![](pic/pic3_10.jpg)
<br><br><br><br>

In [ ]:
%%sql  
SELECT last_name, UPPER(CONCAT(SUBSTR(LAST_NAME, 1, 8), '_US'))
FROM   employees
WHERE  department_id = 60;

### 일반 함수


* IFNULL(expr1,expr2): If expr1 is not NULL, IFNULL() returns expr1; otherwise it returns expr2.
* NULLIF(expr1,expr2): Returns NULL if expr1 = expr2 is true, otherwise returns expr1. This is the same as CASE WHEN expr1 = expr2 THEN NULL ELSE expr1 END.
* IF(expr1,expr2,expr3): If expr1 is TRUE (expr1 <> 0 and expr1 <> NULL), IF() returns expr2. Otherwise, it returns expr3.
* CASE value WHEN [compare_value] THEN result [WHEN [compare_value] THEN result ...] [ELSE result] END

CASE WHEN [condition] THEN result [WHEN [condition] THEN result ...] [ELSE result] END

The first CASE syntax returns the result for the first value=compare_value comparison that is true. The second syntax returns the result for the first condition that is true. If no comparison or condition is true, the result after ELSE is returned, or NULL if there is no ELSE part.

<br><br><br><br>

In [74]:
%%sql 
SELECT last_name, salary, IFNULL(commission_pct, 0), (salary*12) + (salary*12*IFNULL(commission_pct, 0)) AN_SAL
FROM   employees;

 * mysql://root:***@localhost/galaxy
19 rows affected.

[('King', Decimal('100000.00'), Decimal('0.00'), Decimal('1200000.0000')),
 ('Kochhar', Decimal('100000.00'), Decimal('0.00'), Decimal('1200000.0000')),
 ('De Haan', Decimal('100000.00'), Decimal('0.00'), Decimal('1200000.0000')),
 ('Hunold', Decimal('100000.00'), Decimal('0.00'), Decimal('1200000.0000')),
 ('Ernst', Decimal('100000.00'), Decimal('0.00'), Decimal('1200000.0000')),
 ('Lorentz', Decimal('100000.00'), Decimal('0.00'), Decimal('1200000.0000')),
 ('Mourgos', Decimal('100000.00'), Decimal('0.00'), Decimal('1200000.0000')),
 ('Rajs', Decimal('100000.00'), Decimal('0.00'), Decimal('1200000.0000')),
 ('Davies', Decimal('100000.00'), Decimal('0.00'), Decimal('1200000.0000')),
 ('Matos', Decimal('100000.00'), Decimal('0.00'), Decimal('1200000.0000')),
 ('Vargas', Decimal('100000.00'), Decimal('0.00'), Decimal('1200000.0000')),
 ('Zlotkey', Decimal('100000.00'), Decimal('0.20'), Decimal('1440000.0000')),
 ('Taylor', Decimal('100000.00'), Decimal('0.20'), Decimal('1440000.0000')),
 ('Grant', Decimal('100000.00'), Decimal('0.15'), Decimal('1380000.0000')),
 ('Whalen', Decimal('100000.00'), Decimal('0.00'), Decimal('1200000.0000')),
 ('Hartstein', Decimal('100000.00'), Decimal('0.00'), Decimal('1200000.0000')),
 ('Fay', Decimal('100000.00'), Decimal('0.00'), Decimal('1200000.0000')),
 ('Higgins', Decimal('100000.00'), Decimal('0.00'), Decimal('1200000.0000')),
 ('Gietz', Decimal('100000.00'), Decimal('0.00'), Decimal('1200000.0000'))]

In [75]:
%%sql  
SELECT first_name, LENGTH(first_name) "expr1", last_name,  LENGTH(last_name)  "expr2",
       NULLIF(LENGTH(first_name), LENGTH(last_name)) result
FROM   employees;

 * mysql://root:***@localhost/galaxy
19 rows affected.

[('Curtis', 6, 'Davies', 6, None),
 ('Lex', 3, 'De Haan', 7, 3),
 ('Bruce', 5, 'Ernst', 5, None),
 ('Pat', 3, 'Fay', 3, None),
 ('William', 7, 'Gietz', 5, 7),
 ('Kimberely', 9, 'Grant', 5, 9),
 ('Michael', 7, 'Hartstein', 9, 7),
 ('Shelley', 7, 'Higgins', 7, None),
 ('Alexander', 9, 'Hunold', 6, 9),
 ('Steven', 6, 'King', 4, 6),
 ('Neena', 5, 'Kochhar', 7, 5),
 ('Diana', 5, 'Lorentz', 7, 5),
 ('Randall', 7, 'Matos', 5, 7),
 ('Kevin', 5, 'Mourgos', 7, 5),
 ('Trenna', 6, 'Rajs', 4, 6),
 ('Jonathon', 8, 'Taylor', 6, 8),
 ('Peter', 5, 'Vargas', 6, 5),
 ('Jennifer', 8, 'Whalen', 6, 8),
 ('Eleni', 5, 'Zlotkey', 7, 5)]

### 조건문


* IF(expr1,expr2,expr3): If expr1 is TRUE (expr1 <> 0 and expr1 <> NULL), IF() returns expr2. Otherwise, it returns expr3.

* CASE value WHEN [compare_value] THEN result [WHEN [compare_value] THEN result ...] [ELSE result] END

The first CASE syntax returns the result for the first value=compare_value comparison that is true. The second syntax returns the result for the first condition that is true. If no comparison or condition is true, the result after ELSE is returned, or NULL if there is no ELSE part.

<span style="color:blue">
CASE expr WHEN comparison_expr1 THEN return_expr1  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;[WHEN comparison_expr2 THEN return_expr2  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;WHEN comparison_exprn THEN return_exprn  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ELSE else_expr]  
END



<br><br><br><br>

In [76]:
%%sql  
SELECT last_name, job_id, salary,
       CASE job_id WHEN 'IT_PROG'  THEN  1.10*salary
                   WHEN 'ST_CLERK' THEN  1.15*salary
                   WHEN 'SA_REP'   THEN  1.20*salary
                   ELSE      salary 
       END     "REVISED_SALARY"
FROM   employees;

 * mysql://root:***@localhost/galaxy
19 rows affected.

[('King', 'AD_PRES', Decimal('100000.00'), Decimal('100000.00')),
 ('Kochhar', 'AD_VP', Decimal('100000.00'), Decimal('100000.00')),
 ('De Haan', 'AD_VP', Decimal('100000.00'), Decimal('100000.00')),
 ('Hunold', 'IT_PROG', Decimal('100000.00'), Decimal('110000.0000')),
 ('Ernst', 'IT_PROG', Decimal('100000.00'), Decimal('110000.0000')),
 ('Lorentz', 'IT_PROG', Decimal('100000.00'), Decimal('110000.0000')),
 ('Mourgos', 'ST_MAN', Decimal('100000.00'), Decimal('100000.00')),
 ('Rajs', 'ST_CLERK', Decimal('100000.00'), Decimal('115000.0000')),
 ('Davies', 'ST_CLERK', Decimal('100000.00'), Decimal('115000.0000')),
 ('Matos', 'ST_CLERK', Decimal('100000.00'), Decimal('115000.0000')),
 ('Vargas', 'ST_CLERK', Decimal('100000.00'), Decimal('115000.0000')),
 ('Zlotkey', 'SA_MAN', Decimal('100000.00'), Decimal('100000.00')),
 ('Taylor', 'SA_REP', Decimal('100000.00'), Decimal('120000.0000')),
 ('Grant', 'SA_REP', Decimal('100000.00'), Decimal('120000.0000')),
 ('Whalen', 'AD_ASST', Decimal('100000.00'), Decimal('100000.00')),
 ('Hartstein', 'MK_MAN', Decimal('100000.00'), Decimal('100000.00')),
 ('Fay', 'MK_REP', Decimal('100000.00'), Decimal('100000.00')),
 ('Higgins', 'AC_MGR', Decimal('100000.00'), Decimal('100000.00')),
 ('Gietz', 'AC_ACCOUNT', Decimal('100000.00'), Decimal('100000.00'))]

In [77]:
%%sql  
SELECT last_name, commission_pct, 
       IF (commission_pct, 'TRUE', 'NULL OR O')
FROM employees;

 * mysql://root:***@localhost/galaxy
19 rows affected.

[('King', None, 'NULL OR O'),
 ('Kochhar', None, 'NULL OR O'),
 ('De Haan', None, 'NULL OR O'),
 ('Hunold', None, 'NULL OR O'),
 ('Ernst', None, 'NULL OR O'),
 ('Lorentz', None, 'NULL OR O'),
 ('Mourgos', None, 'NULL OR O'),
 ('Rajs', None, 'NULL OR O'),
 ('Davies', None, 'NULL OR O'),
 ('Matos', None, 'NULL OR O'),
 ('Vargas', None, 'NULL OR O'),
 ('Zlotkey', Decimal('0.20'), 'TRUE'),
 ('Taylor', Decimal('0.20'), 'TRUE'),
 ('Grant', Decimal('0.15'), 'TRUE'),
 ('Whalen', None, 'NULL OR O'),
 ('Hartstein', None, 'NULL OR O'),
 ('Fay', None, 'NULL OR O'),
 ('Higgins', None, 'NULL OR O'),
 ('Gietz', None, 'NULL OR O')]

## <span style="color:red">** 연습문제 **</span>

In [81]:
%%sql
select * 
from employees;

 * mysql://root:***@localhost/galaxy
19 rows affected.

[(100, 'Steven', 'King', 'SKING', '515.123.4567', datetime.date(1987, 6, 17), 'AD_PRES', Decimal('100000.00'), None, None, 90),
 (101, 'Neena', 'Kochhar', 'NKOCHHAR', '515.123.4568', datetime.date(1989, 9, 21), 'AD_VP', Decimal('100000.00'), None, 100, 90),
 (102, 'Lex', 'De Haan', 'LDEHAAN', '515.123.4569', datetime.date(1993, 1, 13), 'AD_VP', Decimal('100000.00'), None, 100, 90),
 (103, 'Alexander', 'Hunold', 'AHUNOLD', '590.423.4567', datetime.date(1990, 1, 3), 'IT_PROG', Decimal('100000.00'), None, 102, 90),
 (104, 'Bruce', 'Ernst', 'BERNST', '590.423.4568', datetime.date(1991, 5, 21), 'IT_PROG', Decimal('100000.00'), None, 103, 90),
 (107, 'Diana', 'Lorentz', 'DLORENTZ', '590.423.5567', datetime.date(1999, 2, 7), 'IT_PROG', Decimal('100000.00'), None, 103, 90),
 (124, 'Kevin', 'Mourgos', 'KMOURGOS', '650.123.5234', datetime.date(1999, 11, 16), 'ST_MAN', Decimal('100000.00'), None, 100, 50),
 (141, 'Trenna', 'Rajs', 'TRAJS', '650.121.8009', datetime.date(1995, 10, 17), 'ST_CLERK', Decimal('100000.00'), None, 124, 50),
 (142, 'Curtis', 'Davies', 'CDAVIES', '650.121.2994', datetime.date(1997, 1, 29), 'ST_CLERK', Decimal('100000.00'), None, 124, 50),
 (143, 'Randall', 'Matos', 'RMATOS', '650.121.2874', datetime.date(1998, 3, 15), 'ST_CLERK', Decimal('100000.00'), None, 124, 50),
 (144, 'Peter', 'Vargas', 'PVARGAS', '650.121.2004', datetime.date(1998, 7, 9), 'ST_CLERK', Decimal('100000.00'), None, 124, 50),
 (149, 'Eleni', 'Zlotkey', 'EZLOTKEY', '011.44.1344.429018', datetime.date(2000, 1, 29), 'SA_MAN', Decimal('100000.00'), Decimal('0.20'), 100, 80),
 (176, 'Jonathon', 'Taylor', 'JTAYLOR', '011.44.1644.429265', datetime.date(1998, 3, 24), 'SA_REP', Decimal('100000.00'), Decimal('0.20'), 149, 80),
 (178, 'Kimberely', 'Grant', 'KGRANT', '011.44.1644.429263', datetime.date(1999, 5, 24), 'SA_REP', Decimal('100000.00'), Decimal('0.15'), 149, None),
 (200, 'Jennifer', 'Whalen', 'JWHALEN', '515.123.4444', datetime.date(1987, 9, 17), 'AD_ASST', Decimal('100000.00'), None, 101, 10),
 (201, 'Michael', 'Hartstein', 'MHARTSTE', '515.123.5555', datetime.date(1996, 2, 17), 'MK_MAN', Decimal('100000.00'), None, 100, 20),
 (202, 'Pat', 'Fay', 'PFAY', '603.123.6666', datetime.date(1997, 8, 17), 'MK_REP', Decimal('100000.00'), None, 201, 20),
 (205, 'Shelley', 'Higgins', 'SHIGGINS', '515.123.8080', datetime.date(1994, 6, 7), 'AC_MGR', Decimal('100000.00'), None, 101, 50),
 (206, 'William', 'Gietz', 'WGIETZ', '515.123.8181', datetime.date(1994, 6, 7), 'AC_ACCOUNT', Decimal('100000.00'), None, 205, 50)]

<br><br>
<span style="color:red">[연습 3]</span> 현재 날짜를 표시하는 SQL 문을 작성하되, 열 레이블로 Date로 하라.

In [79]:
%%sql  
SELECT SYSDATE() Date
FROM   DUAL;

 * mysql://root:***@localhost/galaxy
1 rows affected.

[(datetime.datetime(2019, 9, 25, 16, 42, 33),)]

<br><br>
<span style="color:red">[연습 4]</span> 각 사원에 대하여 사원번호, 이름, 급여 및 15% 인상된 급여를 정수로 표시하라. 인상된 급여의 레이블을 New Salary로 하라.

In [87]:
%%sql
select employee_id, first_name, salary, salary*1.15 "New Salary"
from employees;

 * mysql://root:***@localhost/galaxy
19 rows affected.

[(100, 'Steven', Decimal('100000.00'), Decimal('115000.0000')),
 (101, 'Neena', Decimal('100000.00'), Decimal('115000.0000')),
 (102, 'Lex', Decimal('100000.00'), Decimal('115000.0000')),
 (103, 'Alexander', Decimal('100000.00'), Decimal('115000.0000')),
 (104, 'Bruce', Decimal('100000.00'), Decimal('115000.0000')),
 (107, 'Diana', Decimal('100000.00'), Decimal('115000.0000')),
 (124, 'Kevin', Decimal('100000.00'), Decimal('115000.0000')),
 (141, 'Trenna', Decimal('100000.00'), Decimal('115000.0000')),
 (142, 'Curtis', Decimal('100000.00'), Decimal('115000.0000')),
 (143, 'Randall', Decimal('100000.00'), Decimal('115000.0000')),
 (144, 'Peter', Decimal('100000.00'), Decimal('115000.0000')),
 (149, 'Eleni', Decimal('100000.00'), Decimal('115000.0000')),
 (176, 'Jonathon', Decimal('100000.00'), Decimal('115000.0000')),
 (178, 'Kimberely', Decimal('100000.00'), Decimal('115000.0000')),
 (200, 'Jennifer', Decimal('100000.00'), Decimal('115000.0000')),
 (201, 'Michael', Decimal('100000.00'), Decimal('115000.0000')),
 (202, 'Pat', Decimal('100000.00'), Decimal('115000.0000')),
 (205, 'Shelley', Decimal('100000.00'), Decimal('115000.0000')),
 (206, 'William', Decimal('100000.00'), Decimal('115000.0000'))]

<br><br>
<span style="color:red">[연습 6]</span> 모든 사원의 이름과 급여를 표시하는 SQL 문을 작성하라.   
급여는 15자 길이로 왼쪽에 @ 기호가 채워진 형식으로 표시하고, 열 레이블을 SALARY로 하라.

<span style="color:orange">
King&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;@@@@@@@@@@24000

In [91]:
%%sql
select first_name, LPAD(salary,15, '@')
from employees

 * mysql://root:***@localhost/galaxy
19 rows affected.

[('Steven', '@@@@@@100000.00'),
 ('Neena', '@@@@@@100000.00'),
 ('Lex', '@@@@@@100000.00'),
 ('Alexander', '@@@@@@100000.00'),
 ('Bruce', '@@@@@@100000.00'),
 ('Diana', '@@@@@@100000.00'),
 ('Kevin', '@@@@@@100000.00'),
 ('Trenna', '@@@@@@100000.00'),
 ('Curtis', '@@@@@@100000.00'),
 ('Randall', '@@@@@@100000.00'),
 ('Peter', '@@@@@@100000.00'),
 ('Eleni', '@@@@@@100000.00'),
 ('Jonathon', '@@@@@@100000.00'),
 ('Kimberely', '@@@@@@100000.00'),
 ('Jennifer', '@@@@@@100000.00'),
 ('Michael', '@@@@@@100000.00'),
 ('Pat', '@@@@@@100000.00'),
 ('Shelley', '@@@@@@100000.00'),
 ('William', '@@@@@@100000.00')]

<br><br>
<span style="color:red">[연습 5]</span> 각 사원에 대하여 다음 항목을 생성하는 질의어를 작성하라. (3배의 월급을 원한다.) FORMAT( )을 사용하라. \\ \\ \\$

사원 King 월급 24000 의 예

<span style="color:orange">
King earns \$24,000 monthly but wants $72,000.

In [93]:
%%sql
help format

 * mysql://root:***@localhost/galaxy
1 rows affected.

[('FORMAT', "Syntax:\nFORMAT(X,D[,locale])\n\nFormats the number X to a format like '#,###,###.##', rounded to D\ndecimal places, and returns the result as a stri ... (379 characters truncated) ... en/locale-support.html). If no\nlocale is specified, the default is 'en_US'.\n\nURL: http://dev.mysql.com/doc/refman/8.0/en/string-functions.html\n\n", "mysql> SELECT FORMAT(12332.123456, 4);\n        -> '12,332.1235'\nmysql> SELECT FORMAT(12332.1,4);\n        -> '12,332.1000'\nmysql> SELECT FORMAT(12332.2,0);\n        -> '12,332'\nmysql> SELECT FORMAT(12332.2,2,'de_DE');\n        -> '12.332,20'\n")]

In [98]:
%%sql
select first_name, format(salary,#)
from employees

 * mysql://root:***@localhost/galaxy
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'from employees' at line 2") [SQL: 'select first_name, format(salary,#)\nfrom employees'] (Background on this error at: http://sqlalche.me/e/f405)

<br><br>
<span style="color:red">[연습 7]</span> 사원의 이름과 커미션을 표시하는 SQL 문을 작성하라.   
커미션을 받지 못하는 사원은 "No Commission" 이라고 표시하라.

<span style="color:orange">
King&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;No Commission

In [99]:
%%sql
select first_name, ifnull(commission_pct,'NO Commission')
from employees

 * mysql://root:***@localhost/galaxy
19 rows affected.

[('Steven', 'NO Commission'),
 ('Neena', 'NO Commission'),
 ('Lex', 'NO Commission'),
 ('Alexander', 'NO Commission'),
 ('Bruce', 'NO Commission'),
 ('Diana', 'NO Commission'),
 ('Kevin', 'NO Commission'),
 ('Trenna', 'NO Commission'),
 ('Curtis', 'NO Commission'),
 ('Randall', 'NO Commission'),
 ('Peter', 'NO Commission'),
 ('Eleni', '0.20'),
 ('Jonathon', '0.20'),
 ('Kimberely', '0.15'),
 ('Jennifer', 'NO Commission'),
 ('Michael', 'NO Commission'),
 ('Pat', 'NO Commission'),
 ('Shelley', 'NO Commission'),
 ('William', 'NO Commission')]

<br><br>
<span style="color:red">[연습 8]</span> 사원의 이름을 표시하고 급여총액을 별표(\*)로 나타내는 SQL 문을 작성하라.   
\* 표 하나당 1000 을 나타낸다. 급여를 기준으로 내림차순으로 정렬하라. 아래 예에서 King의 별표는 24개 이다.

<span style="color:orange">
King \*\*\*\*\*\*\*\*\*\*\*\*\*\*\*\*\*\*\*\*\*\*\*\*

In [100]:
%%sql
select first_name, sum(salary)
from employees

 * mysql://root:***@localhost/galaxy
1 rows affected.

[('Steven', Decimal('1900000.00'))]